## Checking and Removing Duplicates

In [1]:
import pandas as pd
df = pd.read_csv(r"C:\Users\joy\Downloads\messy_data.csv")
df

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

In [2]:
# Checking for duplicate rows
df["TrnsnID"].duplicated().value_counts()

TrnsnID
False    10000
True       100
Name: count, dtype: int64

In [3]:
df["CusmrID"].duplicated().value_counts()

CusmrID
True     9101
False     999
Name: count, dtype: int64

In [4]:
df["ProdtID"].duplicated().value_counts()

ProdtID
True     10000
False      100
Name: count, dtype: int64

# Removing duplicates in the TransactionID

In [5]:
# The duplicates in the transactionID would be removed because, transactionID are meant to be unique for every customer,
# the CustomerID can be duplicated because the customer may order mutiple times but different products
# the productID can be duplicated because the customer may chose to buy the same product more than once.
df.drop_duplicates(inplace=True)

In [6]:
# It is evident that are no longer duplicates across the rows.
df["TrnsnID"].duplicated().value_counts()

TrnsnID
False    10000
Name: count, dtype: int64

In [7]:
df["CusmrID"].duplicated().value_counts()

CusmrID
True     9001
False     999
Name: count, dtype: int64

In [8]:
df["ProdtID"].duplicated().value_counts()

ProdtID
True     9900
False     100
Name: count, dtype: int64

## Checking and Handling missing values

In [9]:
df.isna().sum()

TrnsnID           0
Data              0
CusmrID           0
ProdtID           0
ProdtName       994
Qutity            0
Prize             0
TtlSales          0
PaymentType    1439
CusterAge         0
dtype: int64

In [10]:
df.head(10)

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
5,2532,19-08-2032,185,1090,Bok N,12,102.69,488.23,NaN,54
6,2996,04/03/2031,571,1086,Book D,15,176.27,4822.26,Cash,-4
7,7660,27-02-2031,172,1012,Book P,12,44.51,4966.85,Cash,82
8,8225,26-05-2026,342,1098,Book P,11,72.57,4920.76,NaN,51
9,4449,02/05/2030,614,1086,Book M,5,15.67,714.58,Debit,95

In [11]:
# The Backfill method was used, because the first data on the PaymentType is null, 
# I considered it best to use the backfill method, using ffill will not solve the null value in this column.
df.fillna(method="bfill", inplace=True)

In [12]:
df.isna().sum()

TrnsnID        0
Data           0
CusmrID        0
ProdtID        0
ProdtName      0
Qutity         0
Prize          0
TtlSales       0
PaymentType    0
CusterAge      0
dtype: int64

# Consistent Date Format

In [13]:
df.sample(n=4)

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
8756,2397,06/29/2024,503,1007,Book O,10,36.71,3282.05,debit card,96
8862,1467,05/22/2032,797,1085,Book O,-1,69.79,3347.74,Debit,24
1460,4053,15-02-2027,396,1057,Book M,17,97.37,4320.00,Credit,76
2222,9301,24-08-2026,907,1015,Bookk H,-5,93.26,641.37,paypal,97

In [14]:
# Using a Unified Date format
df['Data'] = pd.to_datetime(df['Data'], format = 'mixed')
df

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,2026-03-17,991,1045,Boo E,9,167.72,2935.06,debit card,87
1,5835,2035-01-26,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,2035-05-26,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,2036-02-28,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,2023-04-19,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,2027-04-03,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,2025-08-16,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,2026-06-18,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,2034-04-08,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,2029-04-26,153,1052,Book T,10,159.98,2743.67,debit card,77

# Standardizing the payment type names

In [15]:
df['PaymentType'].sample(n=5)

4017    Credit Card
792           Debit
3976     debit card
8423    Credit Card
2275           Cash
Name: PaymentType, dtype: object

In [16]:
# using the dictionary data structure to replace payment type names.
df['PaymentType'] = df['PaymentType'].replace({
    'paypal' : 'Paypal',
    'debit card' : 'Debit Card',
    'Debit' : 'Debit Card',
    'Credit' : 'Credit Card',
    
})
df['PaymentType']

0         Debit Card
1         Debit Card
2               Cash
3               Cash
4               Cash
            ...
10095    Credit Card
10096         Paypal
10097     Debit Card
10098     Debit Card
10099     Debit Card
Name: PaymentType, Length: 10000, dtype: object

In [267]:
df['PaymentType'].sample(n=5)

6592    Credit Card
4097         Paypal
8471     Debit Card
4647    Credit Card
1257     Debit Card
Name: PaymentType, dtype: object

# Identifying and stripping off the negative values

In [347]:
# Identifying the numeric columns
import numpy as np
numeric_columns = df.select_dtypes(include=['int', 'float']).columns

numeric_columns

Index(['TrnsnID', 'CusmrID', 'ProdtID', 'Qutity', 'Prize', 'TtlSales',
       'CusterAge'],
      dtype='object')

In [290]:
# Identifying the negative values
df = df.apply(pd.to_numeric, errors='coerce')

negative_values = df[df < 0]

negative_values.sum()

TrnsnID           0.0
Data              0.0
CusmrID           0.0
ProdtID           0.0
ProdtName         0.0
Qutity        -5830.0
Prize             0.0
TtlSales          0.0
PaymentType       0.0
CusterAge     -5280.0
dtype: float64

In [348]:
# striping off the negative values
df['Qutity'] = df['Qutity'].abs()

# Print the updated DataFrame
df.sample(n=4)

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
4726,7390,11-04-2030,247,1060,Bok N,6,197.76,3997.59,Paypal,-1
3864,4380,08-04-2035,503,1075,Book S,2,133.11,3127.95,Cash,4
8110,8865,10/24/2033,274,1086,Book J,9,19.09,2729.50,Credit Card,54
6239,6493,11/25/2033,503,1025,Book O,2,98.14,4751.23,Cash,52

In [349]:
# striping off the negative values
df['CusterAge'] = df['CusterAge'].abs()

# Print the updated DataFrame
df.sample(n=4)

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
1559,3990,02-10-2026,132,1089,Book K,1,17.69,2165.18,Debit Card,58
9648,5388,09-05-2028,121,1070,Book S,0,98.12,3403.81,Cash,47
8161,4518,16-03-2026,684,1014,Book D,12,191.70,1474.98,Debit Card,7
3712,6316,11/23/2029,566,1052,Bok N,8,139.25,3888.96,Paypal,69

In [350]:
# Identifying the Zero values in Quantity
zero_values = df['Qutity'] == 0
zero_values.sum()

447

In [351]:
df['Qutity'] = df['Qutity'].replace(0, np.nan)
df['Qutity'] = df['Qutity'].fillna(df['Qutity'].mean())
df['Qutity']

0         9.0
1        18.0
2         5.0
3         6.0
4        15.0
         ...
10095     1.0
10096     2.0
10097     5.0
10098    19.0
10099    10.0
Name: Qutity, Length: 10000, dtype: float64

# Identifying unrealistic values in columns

In [352]:
df[['Qutity', 'Prize', 'TtlSales']]

       Qutity   Prize  TtlSales
0         9.0  167.72   2935.06
1        18.0  193.27   4386.52
2         5.0  126.39   1948.46
3         6.0   66.98   1757.26
4        15.0   33.63   2578.19
...       ...     ...       ...
10095     1.0  191.41   2788.25
10096     2.0  186.16   1187.53
10097     5.0   84.38   2119.76
10098    19.0  137.58   1708.87
10099    10.0  159.98   2743.67

[10000 rows x 3 columns]

In [353]:
# Calculating total Sales from quantity and price
calculated_sales = df['Qutity'] * df['Prize']
calculated_sales.head(5)

0    1509.48
1    3478.86
2     631.95
3     401.88
4     504.45
dtype: float64

In [354]:
# Identifying rows where calculated sales doesn't match the total sales
unrealistic_values = calculated_sales != df['TtlSales']

unrealistic_values.value_counts()

True    10000
Name: count, dtype: int64

# Correcting typos and textual errors

In [355]:
df['ProdtName'] = df['ProdtName'].replace({
    'Boo E' : 'Book E',
    'Bok N' : 'Book N',
    'Bookk H' : 'Book H',
})
df['ProdtName'].head(5)

0    Book E
1    Book J
2    Book N
3    Book I
4    Book B
Name: ProdtName, dtype: object

# Renaming the columns

In [356]:
df = df.rename(columns={
    'TrnsnID' : 'TransactionID',
    'Data' : 'Date',
    'CusmrID' : 'CustomerID',
    'ProdtID' : 'ProductID',
    'ProdtName' : 'ProductName',
    'Qutity' : 'Quantity',
    'TtlSales' : 'TotalSales',
    'CusterAge' : 'CustomerAge'
})
df.sample(n=3)

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Prize,TotalSales,PaymentType,CustomerAge
8011,9666,06/01/2029,895,1077,Book F,19.0,93.26,2901.31,Paypal,86
8145,6599,07-02-2028,823,1078,Book G,13.0,52.41,672.10,Debit Card,7
4318,1565,09/04/2023,657,1051,Book B,5.0,102.53,4640.88,Debit Card,6

# Data Types: Ensuring each column is of the right data

In [357]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  10000 non-null  int64
 1   Date           10000 non-null  object
 2   CustomerID     10000 non-null  int64
 3   ProductID      10000 non-null  int64
 4   ProductName    10000 non-null  object
 5   Quantity       10000 non-null  float64
 6   Prize          10000 non-null  float64
 7   TotalSales     10000 non-null  float64
 8   PaymentType    10000 non-null  object
 9   CustomerAge    10000 non-null  int64
dtypes: float64(3), int64(4), object(3)
memory usage: 859.4+ KB

In [358]:
# Changing the datatype to integer
df['Quantity'] = df['Quantity'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  10000 non-null  int64
 1   Date           10000 non-null  object
 2   CustomerID     10000 non-null  int64
 3   ProductID      10000 non-null  int64
 4   ProductName    10000 non-null  object
 5   Quantity       10000 non-null  int32
 6   Prize          10000 non-null  float64
 7   TotalSales     10000 non-null  float64
 8   PaymentType    10000 non-null  object
 9   CustomerAge    10000 non-null  int64
dtypes: float64(2), int32(1), int64(4), object(3)
memory usage: 820.3+ KB

In [364]:
# Changing the data type to datetime with double format
date_formats = ['%m/%d/%Y', '%d-%m-%Y']

def convert_date(date_str):
    for fmt in date_formats:
        try:
            return pd.to_datetime(date_str, format=fmt)
        except ValueError:
            continue
    return pd.NaT # Return NaT if no valid date format is found

# Convert Date Column Datatype to datetime
df['Date'] = df['Date'].apply(convert_date)
df.sample(n=4)

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Prize,TotalSales,PaymentType,CustomerAge
7999,6512,2029-08-19,905,1066,Book K,10,97.12,418.00,Debit Card,98
708,7610,2030-01-07,449,1091,Book E,2,132.61,876.73,Credit Card,16
5634,3983,2031-08-28,383,1033,Book R,3,35.53,554.08,Credit Card,11
2884,9078,2029-01-13,337,1071,Book N,8,79.90,2833.91,Credit Card,89

In [366]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  10000 non-null  int64
 1   Date           10000 non-null  datetime64[ns]
 2   CustomerID     10000 non-null  int64
 3   ProductID      10000 non-null  int64
 4   ProductName    10000 non-null  object
 5   Quantity       10000 non-null  int32
 6   Prize          10000 non-null  float64
 7   TotalSales     10000 non-null  float64
 8   PaymentType    10000 non-null  object
 9   CustomerAge    10000 non-null  int64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(4), object(2)
memory usage: 820.3+ KB